Elements can't be copied because they will lose their References.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyNoReferences { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyNoReferences As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyNoReferences {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace